// Напишите программу, которая будет принимать на вход два числа и выводить, является ли второе число кратным первому.
Console.Write("Введите первое число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int num2 = Convert.ToInt32(Console.ReadLine());
if (num1 % num2 == 0)
{
    Console.WriteLine($"{num2} кратно {num1}");
}
else
{
    Console.WriteLine($"{num2} не кратно {num1}");
}